# CurrentViewSheetSet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheetSetting..::..CurrentViewSheetSet Property
ViewSheetSetting Class See Also
---
The current view sheet set of PrintSetup.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IViewSheetSet CurrentViewSheetSet { get; set; }
```

Visual Basic
---
```text
Public Property CurrentViewSheetSet As IViewSheetSet
	Get
	Set
```

Visual C++
---
```text
public:
property IViewSheetSet^ CurrentViewSheetSet {
	IViewSheetSet^ get ();
	void set (IViewSheetSet^ value);
}
```

# See Also
ViewSheetSetting Class
Autodesk.Revit.DB Namespace